<a href="https://colab.research.google.com/github/jaaaamj0711/TIL/blob/main/pyda/1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!git clone https://github.com/wikibook/pyda100.git

Cloning into 'pyda100'...
remote: Enumerating objects: 494, done.
remote: Counting objects: 100% (5/5), done.
remote: Compressing objects: 100% (5/5), done.
remote: Total 494 (delta 0), reused 1 (delta 0), pack-reused 489
Receiving objects: 100% (494/494), 476.81 MiB | 33.53 MiB/s, done.
Resolving deltas: 100% (14/14), done.
Checking out files: 100% (476/476), done.

In [9]:
import os
import pandas as pd

In [7]:
os.chdir("/content/pyda100/1장")

In [8]:
os.listdir()

['customer_master.csv',
 '.ipynb_checkpoints',
 '제1장_answer.ipynb',
 'transaction_detail_2.csv',
 'transaction_2.csv',
 'item_master.csv',
 'transaction_1.csv',
 'transaction_detail_1.csv']

In [33]:
customer_master = pd.read_csv("customer_master.csv")
customer_master.head()

  customer_id customer_name registration_date  ... age       birth   pref
0    IK152942           김서준   2019-01-01 0:25  ...  29  1990-06-10  대전광역시
1    TS808488           김예준   2019-01-01 1:13  ...  33  1986-05-20  인천광역시
2    AS834628           김도윤   2019-01-01 2:00  ...  63  1956-01-02  광주광역시
3    AS345469           김시우   2019-01-01 4:48  ...  74  1945-03-25  인천광역시
4    GD892565           김주원   2019-01-01 4:54  ...  54  1965-08-05  울산광역시

[5 rows x 8 columns]

In [34]:
item_master = pd.read_csv("item_master.csv")
item_master.head()

  item_id item_name  item_price
0    S001      PC-A       50000
1    S002      PC-B       85000
2    S003      PC-C      120000
3    S004      PC-D      180000
4    S005      PC-E      210000

In [35]:
transaction_1 = pd.read_csv("transaction_1.csv")
transaction_1.head()

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019
2    T0000000115  120000  2019-02-01 02:34:19    HD298120
3    T0000000116  210000  2019-02-01 02:47:23    IK452215
4    T0000000117  170000  2019-02-01 04:33:46    PL542865

In [36]:
transaction_2 = pd.read_csv("transaction_2.csv")
transaction_2.head()

  transaction_id   price         payment_date customer_id
0    T0000005113  295000  2019-06-15 07:20:27    TS169261
1    T0000005114   50000  2019-06-15 07:35:47    HI599892
2    T0000005115   85000  2019-06-15 07:56:36    HI421757
3    T0000005116   50000  2019-06-15 08:40:55    OA386378
4    T0000005117  120000  2019-06-15 08:44:23    TS506913

In [37]:
transaction = pd.concat([transaction_1, transaction_2], ignore_index=True) #i gnore_index=True : 기존 인덱스를 무시
transaction.head(3)

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019
2    T0000000115  120000  2019-02-01 02:34:19    HD298120

In [38]:
print(len(transaction_1))
print(len(transaction_2))
print(len(transaction))

5000
1786
6786

In [39]:
transaction_detail_1 = pd.read_csv("transaction_detail_1.csv")
transaction_detail_1.head()

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1
1          1    T0000000114    S001         1
2          2    T0000000115    S003         1
3          3    T0000000116    S005         1
4          4    T0000000117    S002         2

In [48]:
transaction_detail_2 = pd.read_csv("transaction_detail_2.csv")
transaction_detail_2.head()

   detail_id transaction_id item_id  quantity
0       5000    T0000004870    S002         3
1       5001    T0000004871    S003         1
2       5002    T0000004872    S001         2
3       5003    T0000004873    S004         1
4       5004    T0000004874    S003         2

In [49]:
transaction_detail = pd.concat([transaction_detail_1, transaction_detail_2], ignore_index=True) #i gnore_index=True : 기존 인덱스를 무시
transaction_detail.head(3)

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1
1          1    T0000000114    S001         1
2          2    T0000000115    S003         1

In [50]:
print(len(transaction_detail_1))
print(len(transaction_detail_2))
print(len(transaction_detail))

5000
2144
7144

In [51]:
join_data = pd.merge(transaction_detail, transaction[['transaction_id', 'payment_date', 'customer_id']],
                     on = 'transaction_id', how='left')
join_data.head()

   detail_id transaction_id item_id  quantity         payment_date customer_id
0          0    T0000000113    S005         1  2019-02-01 01:36:57    PL563502
1          1    T0000000114    S001         1  2019-02-01 01:37:23    HD678019
2          2    T0000000115    S003         1  2019-02-01 02:34:19    HD298120
3          3    T0000000116    S005         1  2019-02-01 02:47:23    IK452215
4          4    T0000000117    S002         2  2019-02-01 04:33:46    PL542865

In [52]:
print(len(transaction_detail))
print(len(transaction))
print(len(join_data))

7144
6786
7144

In [53]:
join_data = pd.merge(join_data, customer_master, on = 'customer_id', how ='left')
join_data = pd.merge(join_data, item_master, on = 'item_id', how = 'left')
join_data.head()

   detail_id transaction_id item_id  ...   pref item_name item_price
0          0    T0000000113    S005  ...  대전광역시      PC-E     210000
1          1    T0000000114    S001  ...  서울특별시      PC-A      50000
2          2    T0000000115    S003  ...  광주광역시      PC-C     120000
3          3    T0000000116    S005  ...  인천광역시      PC-E     210000
4          4    T0000000117    S002  ...  광주광역시      PC-B      85000

[5 rows x 15 columns]

In [54]:
join_data['price'] = join_data['quantity'] * join_data['item_price']
join_data[['quantity','item_price','price']].head()

   quantity  item_price   price
0         1      210000  210000
1         1       50000   50000
2         1      120000  120000
3         1      210000  210000
4         2       85000  170000

In [55]:
# 데이터 검토
print(join_data['price'].sum())
print(transaction['price'].sum())

971135000
971135000

In [56]:
join_data.isnull().sum()

detail_id            0
transaction_id       0
item_id              0
quantity             0
payment_date         0
customer_id          0
customer_name        0
registration_date    0
email                0
gender               0
age                  0
birth                0
pref                 0
item_name            0
item_price           0
price                0
dtype: int64

In [57]:
join_data.describe()

         detail_id     quantity          age     item_price          price
count  7144.000000  7144.000000  7144.000000    7144.000000    7144.000000
mean   3571.500000     1.199888    50.265677  121698.628219  135937.150056
std    2062.439494     0.513647    17.190314   64571.311830   68511.453297
min       0.000000     1.000000    20.000000   50000.000000   50000.000000
25%    1785.750000     1.000000    36.000000   50000.000000   85000.000000
50%    3571.500000     1.000000    50.000000  102500.000000  120000.000000
75%    5357.250000     1.000000    65.000000  187500.000000  210000.000000
max    7143.000000     4.000000    80.000000  210000.000000  420000.000000